#Копирайте <РЕПО>/exercises/data/emp.data във вашата home директория.
#Посредством awk, използвайки копирания файл за входнни данни, изведете:

#- общия брой редове
awk 'END {print NR}' emp.data

#- третия ред
cat emp.data | awk ' NR == 3 {print $0}'

#- последното поле от всеки ред
cat emp.data | awk ' {print $NF}'

#- последното поле на последния ред
 cat emp.data | awk 'END {print $NF}'

#- всеки ред, който има повече от 4 полета
awk 'NF>4 {print $0}' emp.data

#- всеки ред, чието последно поле е по-голямо от 4
 awk '$NF > 4 {print $0}' emp.data

#- общия брой полета във всички редове


#- броя редове, в които се среща низът Beth
#- най-голямото трето поле и редът, който го съдържа
#- всеки ред, който има поне едно поле
#- всеки ред, който има повече от 17 знака
#- броя на полетата във всеки ред и самият ред
#- първите две полета от всеки ред, с разменени места
#- всеки ред така, че първите две полета да са с разменени места
#- всеки ред така, че на мястото на първото поле да има номер на реда
#- всеки ред без второто поле
#- за всеки ред, сумата от второ и трето поле
#- сумата на второ и трето поле от всеки ред